// Задача 4: Напишите программу, которая принимает на вход три числа 
//и выдаёт максимальное из этих чисел. 

internal class Program
{
    private static void Main(string[] args)
    {
        // Обявляем длину массива
        int[] qwe = { 1, 2, 3 };
int i = 0;
    }
}
/*
// Заполнение массива
Console.WriteLine("Введите числа");
while(i < 3)
{
   chislo[i] = Convert.ToInt32(Console.ReadLine());
   i++;
}*/
