// Задача 4: Напишите программу, которая принимает на вход три числа 
//и выдаёт максимальное из этих чисел. 

/*
// Заполнение массива
Console.WriteLine("Введите числа");
while(i < 3)
{
   chislo[i] = Convert.ToInt32(Console.ReadLine());
   i++;
}*/
